renesas/ArduinoCore-rl78g22_fpb/cores/rl78g22/HardwareUart.cpp
size_t HardwareUart::write(uint8_t c)
{
    size_t err = 0;
    err = UART_Send(c);
    return err;
}


/**********************************************************************************************************************
 * Function Name: HardwareUart::availableForWrite
 * Description  : Get the number of available transmit buffer space for write.
 * Arguments    : -
 * Return Value : size of transmit buffer free space
 *********************************************************************************************************************/
int HardwareUart::availableForWrite(void)
{
    int head = 0;
    int tail = 0;
    noInterrupts();
    head = _tx_buffer_head;
    tail = _tx_buffer_tail;
    interrupts();
    if (head >= tail) return _tx_buf_size - 1 - head + tail;
    return (tail - head - 1);
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::availableForRead
 * Description  : Get the number of available receive buffer space for read.
 * Arguments    : -
 * Return Value : size of receive buffer free space
 *********************************************************************************************************************/
int HardwareUart::availableForRead(void)
{
    int head = 0;
    int tail = 0;
    noInterrupts();
    head = _rx_buffer_head;
    tail = _rx_buffer_tail;
    interrupts();
    if (head >= tail) return _rx_buf_size - 1 - head + tail;
    return (tail - head - 1);
}

HardwareUart::operator bool() {
    return true;
}

/* Load Send data from Send Buffer & Start New Send Function */
/**********************************************************************************************************************
 * Function Name: HardwareUart::load_char
 * Description  : Extract 1 byte from the transmit buffer and send it.
 *              : Called from the transmission complete interrupt handler.
 *              : Unavailable for the other purpose.
 * Arguments    :  -
 * Return Value :  -
 *********************************************************************************************************************/
void HardwareUart::load_char(void){
    int i = (_tx_buffer_tail + 1) % _tx_buf_size;
    _tx_buffer_tail = i;
    if (i != _tx_buffer_head) {
        uint8_t send_buffer  = _tx_buffer[i];
        switch (_urt_channel)
        {
        case 0:
#if (UART_CHANNEL == 0)
            R_Config_UART0_Send((uint8_t * const)&send_buffer,1);
#endif /* (UART_CHANNEL == 0) */
            break;
        case 1:
#if (UART1_CHANNEL == 1)
            R_Config_UART1_Send((uint8_t * const)&send_buffer,1);
#endif /* (UART1_CHANNEL == 1) */
            break;
        case 2:
#if (UART2_CHANNEL == 2)
            R_Config_UART2_Send((uint8_t * const)&send_buffer,1);
#endif /* (UART2_CHANNEL == 2) */
            break;
        case 3:
#if (UART3_CHANNEL == 3)
                R_Config_UARTA0_Send((uint8_t * const)&send_buffer,1);
#endif /* (UART3_CHANNEL == 3) */
            break;
        }
    }
}


/* Store Received data to Receive Buffer & Start New Receive Function */
/**********************************************************************************************************************
 * Function Name: HardwareUart::store_char
 * Description  : Store 1 byte of the last received data in the receive buffer
 *              : and continue the receive process for the following bytes.
 *              : Called from the receive complete interrupt handler.
 *              : Unavailable for the other purpose.
 * Arguments    : -
 * Return Value : -
 *********************************************************************************************************************/
void HardwareUart::store_char(void){
    store_char(receive_buffer);
    receive_buffer = 0;
    switch (_urt_channel)
    {
    case 0:
    #if (UART_CHANNEL == 0)
        R_Config_UART0_Receive((uint8_t * const)&receive_buffer,1);
    #endif /* (UART_CHANNEL == 0) */
        break;
    case 1:
    #if (UART1_CHANNEL == 1)
        R_Config_UART1_Receive((uint8_t * const)&receive_buffer,1);
    #endif /* (UART1_CHANNEL == 1) */
        break;
    case 2:
    #if (UART2_CHANNEL == 2)
        R_Config_UART2_Receive((uint8_t * const)&receive_buffer,1);
    #endif /* (UART2_CHANNEL == 2) */
        break;
        case 3:
#if (UART3_CHANNEL == 3)
            R_Config_UARTA0_Receive((uint8_t * const)&receive_buffer,1);
#endif /* (UART3_CHANNEL == 3) */
        break;
    }
}

/**********************************************************************************************************************
 * Function Name: HardwareUart::store_char
 * Description  : Store 1 byte of the last received data in the receive buffer
 *              : and continue the receive process for the following bytes.
 *              : Make sure to disable interrupts before calling this from outside of the interrupt handler.
 * Arguments    : c - byte to store
 * Return Value : -
 *********************************************************************************************************************/
void HardwareUart::store_char(unsigned char c){
    int i = (_rx_buffer_head + 1) % _rx_buf_size;
    if (i != _rx_buffer_tail)
    {
        _rx_buffer[_rx_buffer_head] = c;
        _rx_buffer_head = i;
    }
}

/* Add for RL78/G23 RL78/G22 */
/**********************************************************************************************************************
 * Function Name: HardwareUart::Set_Baudrate
 * Description  : Set baud rate for the serial port.
 * Arguments    : baudrate - baud rate
 *              :            { 300, 600, 1200, 2400, 4800, 9600, 14400, 19200, 28800, 31250, 38400, 57600, 115200 }
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::Set_Baudrate(unsigned long baudrate)
{
    if (( _urt_channel == 0 ) || ( _urt_channel == 1 )  || ( _urt_channel == 2 ))
    {
        uint32_t fclk_frequency;
        uint32_t  peri_clk    ;
        uint8_t  sdr     ;
        uint16_t tmp_sdr ;
        uint8_t  prs = 0U;
        fclk_frequency = R_BSP_GetFclkFreqHz();

        peri_clk    = (fclk_frequency) ; /* SPSmk0\[3:0] = 0x0 */

        tmp_sdr = (uint16_t)(((peri_clk/baudrate) >> 1) -1) ;
        while(0x007F<tmp_sdr)
        {
            prs++;
            peri_clk = (peri_clk >> 1);
            tmp_sdr  = (uint16_t)(((peri_clk/baudrate) >> 1) -1) ;
        }

        sdr     = (uint8_t)(tmp_sdr & 0x007F) ;

        switch (_urt_channel)
        {
            case 0:
#if ( UART_CHANNEL == 0 )
                SPS0 &= (_00F0_SAU_CK00_CLEAR) ;
                SPS0 |=  prs ;
                SDR00 = ((uint16_t)sdr) << 9 ;
                SDR01 = ((uint16_t)sdr) << 9 ;
#endif /* ( UART_CHANNEL == 0 ) */
                break;
            case 1:
#if ( UART1_CHANNEL == 1 )
                SPS0 &= (_000F_SAU_CK01_CLEAR) ;
                SPS0 |= ((uint16_t)prs << 4);
                SDR02 = ((uint16_t)sdr) << 9 ;
                SDR03 = ((uint16_t)sdr) << 9 ;
#endif /* ( UART1_CHANNEL == 1 ) */
                break;
            case 2:
#if ( UART2_CHANNEL == 2 )
                SPS1 &= (_00F0_SAU_CK00_CLEAR) ;
                SPS1 |= prs ;
                SDR10 = ((uint16_t)sdr) << 9 ;
                SDR11 = ((uint16_t)sdr) << 9 ;
#endif /* ( UART2_CHANNEL == 2 ) */
                break;
            default :
            /* Do nothing */
                break;
        }
    }
    else
    {
        uint16_t tmp_brgc ;
        uint16_t brgc ;
        uint32_t fclk_frequency;
        uint32_t  peri_clk    ;
        uint8_t  prs = 0U;
        fclk_frequency = R_BSP_GetFclkFreqHz();
        peri_clk    = fclk_frequency; /* SPSmk0\[3:0] = 0x0 */
        tmp_brgc = (uint16_t)(((peri_clk/baudrate) >> 1) -1) ;
        while(0x007F<tmp_brgc)
        {
            prs++;
            peri_clk = (peri_clk >> 1);
            tmp_brgc  = (uint16_t)(((peri_clk/baudrate) >> 1) -1) ;
        }
        brgc = (uint16_t)(peri_clk/baudrate);
        UTA0CK = _20_UARTA_FSEL_SELECT_FIHP | prs;
        BRGCA0 =  (uint8_t)(tmp_brgc & 0x00FF) ;

