renesas/ArduinoCore-rl78g22_fpb/cores/rl78g22/HardwareUart.cpp
    }
}

#ifdef __RL78__
/**********************************************************************************************************************
 * Function Name: HardwareUart::Set_Config
 * Description  : Set the serial data length, parity, and stop bit.
 * Arguments    : config - serial port setting
 *               :         SERIAL_{ 8, 7 }{ N, E }{ 1, 2 }
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::Set_Config(uint16_t config )
{
    uint16_t converted_config = 0;

    switch(config)
    {
        case SERIAL_7N1:
        case SERIAL_8N1:
        case SERIAL_7N2:
        case SERIAL_8N2:
        case SERIAL_7E1:
        case SERIAL_8E1:
        case SERIAL_7E2:
        case SERIAL_8E2:
        case SERIAL_7O1:
        case SERIAL_8O1:
        case SERIAL_7O2:
        case SERIAL_8O2:
            /* Do nothing */
            break;
        default:
            config = SERIAL_8N1;
            break;
    }
    if(SERIAL_DATA_7 == (SERIAL_DATA_MASK & config))
    {
        if(( _urt_channel == 0 ) || ( _urt_channel == 1 ) || ( _urt_channel == 2 ))
        {
            converted_config |= _0002_SAU_LENGTH_7;
        }
        else
        {
            converted_config |= _10_UARTA_TRANSFER_LENGTH_7;
        }
    }
    else
    {
        /* All other settings are treated as SERIAL_DATA_8(default). */
        if(( _urt_channel == 0 ) || ( _urt_channel == 1 ) || ( _urt_channel == 2 ))
        {
            converted_config |= _0003_SAU_LENGTH_8;
        }
        else
        {
            converted_config |= _18_UARTA_TRANSFER_LENGTH_8;
        }
    }

    if(SERIAL_STOP_BIT_2 == (SERIAL_STOP_BIT_MASK & config))
    {
        if(( _urt_channel == 0 ) || ( _urt_channel == 1 ) || ( _urt_channel == 2 ))
        {
            converted_config |= _0020_SAU_STOP_2;
        }
        else
        {
            converted_config |= _04_UARTA_STOP_BIT_2;
        }    }
    else
    {
        /* All other settings are treated as SERIAL_STOP_BIT_1(default). */
        if(( _urt_channel == 0 ) || ( _urt_channel == 1 ) || ( _urt_channel == 2 ))
        {
            converted_config |= _0010_SAU_STOP_1;
        }
        else
        {
            converted_config |= _00_UARTA_STOP_BIT_1;
        }
    }

    if(SERIAL_PARITY_EVEN == (SERIAL_PARITY_MASK & config))
    {
        if(( _urt_channel == 0 ) || ( _urt_channel == 1 ) || ( _urt_channel == 2 ))
        {
            converted_config |= _0200_SAU_PARITY_EVEN;
        }
        else
        {
            converted_config |= _60_UARTA_PARITY_EVEN;
        }
    }
    else if(SERIAL_PARITY_ODD == (SERIAL_PARITY_MASK & config))
    {
        if(( _urt_channel == 0 ) || ( _urt_channel == 1 ) || ( _urt_channel == 2 ))
        {
            converted_config |= _0300_SAU_PARITY_ODD;
        }
        else
        {
            converted_config |= _40_UARTA_PARITY_ODD;
        }
    }
    else
    {
        /* All other settings are treated as SERIAL_PARITY_NONE(default). */
        if(( _urt_channel == 0 ) || ( _urt_channel == 1 ) || ( _urt_channel == 2 ))
        {
            converted_config |= _0000_SAU_PARITY_NONE;
        }
        else
        {
            converted_config |= _00_UARTA_PARITY_NONE;
        }
    }

    switch (_urt_channel)
    {
        /* Rewriting prohibited when SEmn = 1 / Set_Config is called between R_Config_UART0_Create () and R_Config_UART0_Start (), so SEmn = 0*/
        case 0:
        {
        /* SCR00 16bit*/
#if ( UART_CHANNEL == 0 )
            unsigned short SCR00data=_8000_SAU_TRANSMISSION |_0000_SAU_INTSRE_MASK |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB | converted_config;
            /* When sending, _0000_SAU_INTSRE_MASK :EOCmn = 0*/
            unsigned short SCR01data=_4000_SAU_RECEPTION |_0400_SAU_INTSRE_ENABLE |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB | converted_config;
            /* _0400_SAU_INTSRE_ENABLE: EOCmn = 1 Allow the occurrence of the error interrupt INTSREx */

            /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
            SCR01data &= ~(_0020_SAU_STOP_2);
            SCR01data |= _0010_SAU_STOP_1;

            SCR00 = SCR00data;
            SCR01 = SCR01data;
#endif /* ( UART_CHANNEL == 0 ) */
        }
        break;

        case 1:
        {
#if ( UART1_CHANNEL == 1 )
            unsigned short SCR02data=_8000_SAU_TRANSMISSION| _0000_SAU_INTSRE_MASK |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            unsigned short SCR03data=_4000_SAU_RECEPTION| _0400_SAU_INTSRE_ENABLE |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
            SCR03data &= ~(_0020_SAU_STOP_2);
            SCR03data |= _0010_SAU_STOP_1;

            SCR02 = SCR02data;
            SCR03 = SCR03data;
#endif /* ( UART1_CHANNEL == 1 ) */
        }
        break;
        case 2:
        {
#if ( UART2_CHANNEL == 2 )
            unsigned short SCR10data=_8000_SAU_TRANSMISSION| _0000_SAU_INTSRE_MASK |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            unsigned short SCR11data=_4000_SAU_RECEPTION| _0400_SAU_INTSRE_ENABLE |_0004_SAU_SCRMN_INITIALVALUE |_0080_SAU_LSB |converted_config;
            /* SLCmn1: 0 SLCmn0: 1 when receiving XXXXXXXXXX01XXXX*/
            SCR11data &= ~(_0020_SAU_STOP_2);
            SCR11data |= _0010_SAU_STOP_1;
            SCR10 = SCR10data;
            SCR11 = SCR11data;
#endif /* ( UART2_CHANNEL == 2 ) */
        }
        break;
        case 3:
        {
#if ( UART3_CHANNEL == 3 )
            unsigned short ASIMA01data = _02_UARTA_DIRECTION_LSB | _00_UARTA_DATA_NORMAL | converted_config;
            ASIMA01 = (unsigned char)ASIMA01data;
            break;
#endif /* ( UART3_CHANNEL == 3 ) */
        }
    }
}
/**********************************************************************************************************************
 End of function Set_Config
 *********************************************************************************************************************/
#endif /* __RL78__ */

/**********************************************************************************************************************
 * Function Name: HardwareUart::Set_SerialPort
 * Description  : Set serial port pins for the target port.
 * Arguments    : txd_pin - transmit pin no.
 *              : rxd_pin - receive  pin no.
 * Return Value : void
 *********************************************************************************************************************/
void HardwareUart::Set_SerialPort(uint8_t txd_pin,uint8_t rxd_pin)
{
    const PinTableType ** pp;
    PinTableType * p;

    /* Set RxD pin */
    //getPinTable(rxd_pin,p);
    pp = &pinTablelist[rxd_pin];
    p = (PinTableType *)*pp;
    /* Set PM Register for Input */
    *p->portModeRegisterAddr |=  (unsigned long)(0x1 << p->bit);

#if defined(G22_FPB) || defined(G23_FPB)
    /* Set PMCA Register */
    if (0!=p->pmca)
    {
        *p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);
    }
#endif // defined(G22_FPB) || defined(G23_FPB)

    /* Set PMCT Register */
#if defined(G22_FPB) || defined(G23_FPB)
    if (0!=p->pmct)
    {
        *p->portModeControlTRegisterAddr &= (unsigned long)~(p->pmct);
    }
#endif // defined(G22_FPB) || defined(G23_FPB)

    /* Set PMCE Register for Output */
#if defined(G23_FPB)
    if (0!=p->pmce)
    {
        *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB
    /* Set CCDE Register for Digital InOut */
#if defined(G23_FPB)
    if (0!=p->ccde)
    {
        CCDE &= (uint8_t)~(p->ccde);
    }
#endif // G23_FPB
#if defined(G16_FPB)
    if (0!=p->pmc)
    {
        *p->portModeControlRegisterAddr &= (unsigned long)~(p->pmc);
    }
#endif // defined(G16_FPB)

    /* Set TxD pin */
    //getPinTable(txd_pin,p);
    pp = &pinTablelist[txd_pin];
    p = (PinTableType *)*pp;
    /* Set PMCE Register t */
#if defined(G23_FPB)
    if (0!=p->pmce)
    {
        *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB

    /* Set P Register for Set "H" Output Port*/
    *p->portRegisterAddr |= (unsigned long)(0x1 << p->bit);

    /* Set PM Register for Output */
    *p->portModeRegisterAddr &= (unsigned long)~(0x1 << p->bit);

    /* Set PMCA Register */
#if defined(G22_FPB) || defined(G23_FPB)
    if (0!=p->pmca)
    {
        *p->portModeControlARegisterAddr &= (unsigned long)~(p->pmca);
    }
#endif // defined(G22_FPB) || defined(G23_FPB)

    /* Set PMCT Register */
#if defined(G22_FPB) || defined(G23_FPB)
    if (0!=p->pmct)
    {
        *p->portModeControlTRegisterAddr &= (unsigned long)~(p->pmct);
    }
#endif // defined(G22_FPB) || defined(G23_FPB)

    /* Set PMCE Register t */
#if defined(G23_FPB)
    if (0!=p->pmce)
    {
        *p->portModeControlERegisterAddr &= (unsigned long)~(p->pmce);
    }
#endif // G23_FPB
    /* Set CCDE Register for Digital InOut */
#if defined(G23_FPB)
    if (0!=p->ccde)
    {
        CCDE &= (uint8_t)~(p->ccde);
    }
#endif // G23_FPB

