renesas/ArduinoCore-rl78g22_fpb/cores/rl78g22/HardwareUart.cpp
#if defined(G16_FPB)
    if (0!=p->pmc)
    {
        *p->portModeControlRegisterAddr &= (unsigned long)~(p->pmc);
    }
#endif // G16_FPB
}

void HardwareUart::setReceiveCallback(void (*userFunc)(void))
{
    uart_receive_callback_table[_urt_channel] = userFunc;
}

void HardwareUart::setTransmitCallback(void (*userFunc)(void))
{
    uart_transmit_callback_table[_urt_channel] = userFunc;
}

extern "C" {
/**********************************************************************************************************************
 * Function Name: Set_Char_Serial_to_buf
 * Description  : Store the received data in the buffer.
 *              : Called from the receive interrupt handler.
 * Arguments    : chn - UART channel
 * Return Value : void
 *********************************************************************************************************************/
void Set_Char_Serial_to_buf(uint8_t chn)
{
    switch (chn)
    {
        case 0:
#if (UART_CHANNEL == 0)
            Serial.store_char();
#endif /* (UART_CHANNEL == 0) */
            break;
        case 1:
#if (UART1_CHANNEL == 1)
            Serial1.store_char();
#endif /* (UART1_CHANNEL == 1) */
            break;
        case 2:
#if (UART2_CHANNEL == 2)
            Serial2.store_char();
#endif /* (UART2_CHANNEL == 2) */
            break;
        case 3:
#if (UART3_CHANNEL == 3)
            Serial3.store_char();
#endif /* (UART3_CHANNEL == 3) */
            break;
    }
}

/**********************************************************************************************************************
 * Function Name: Set_Char_Serial_from_buf
 * Description  : Load write data from the buffer.
 * Arguments    : chn  - UART_CHANNEL
 * Return Value : void         -
 *********************************************************************************************************************/

void Set_Char_Serial_from_buf(uint8_t chn)
{
    switch (chn)
    {
        case 0:
#if (UART_CHANNEL == 0)
            Serial.load_char();
#endif /* (UART_CHANNEL == 0) */
            break;
        case 1:
#if (UART1_CHANNEL == 1)
            Serial1.load_char();
#endif /* (UART1_CHANNEL == 1) */
            break;
        case 2:
#if (UART2_CHANNEL == 2)
            Serial2.load_char();
#endif /* (UART2_CHANNEL == 2) */
            break;
        case 3:
#if (UART3_CHANNEL == 3)
            Serial3.load_char();
#endif /* (UART3_CHANNEL == 3) */
            break;
    }
}

}

// Preinstantiate Objects //////////////////////////////////////////////////////

#if ( UART_CHANNEL == 0 )
    HardwareUart Serial(0);
#endif /* ( UART_CHANNEL == 0 ) */
#if ( UART1_CHANNEL == 1 )
    HardwareUart Serial1(1);
#endif /* ( UART1_CHANNEL == 1 ) */
#if ( UART2_CHANNEL == 2 )
    HardwareUart Serial2(2);
#endif /* ( UART2_CHANNEL == 2 ) */
#if ( UART3_CHANNEL == 3 )
    HardwareUart Serial3(3);
#endif /* ( UART3_CHANNEL == 3 ) */


